ka2_2024/src/Documents/Оффер/Оффер.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Оффер</name>
  <posting>Deny</posting>
  <attributes>
    <name>Кандидат</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокПринятия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>ДолжностьПоШтатномуРасписанию</name>
    <type>
      <types>CatalogRef.ШтатноеРасписание</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыходаНаРаботу</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Document>

ka2_2024/src/Documents/Оффер/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Функция СтруктураЗаполнения() Экспорт
	
	СтруктураЗаполнения = Новый Структура();
	СтруктураЗаполнения.Вставить("Кандидат", Справочники.ФизическиеЛица.ПустаяСсылка());
	СтруктураЗаполнения.Вставить("СрокПринятия", Дата(1, 1, 1, 0, 0, 0));
	СтруктураЗаполнения.Вставить("Должность", Справочники.Должности.ПустаяСсылка());
	СтруктураЗаполнения.Вставить("Подразделение", Неопределено);
	СтруктураЗаполнения.Вставить("ДолжностьПоШтатномуРасписанию", Справочники.ШтатноеРасписание.ПустаяСсылка());
	СтруктураЗаполнения.Вставить("ДатаВыходаНаРаботу", Дата(1, 1, 1, 0, 0, 0));
	СтруктураЗаполнения.Вставить("ИдентификаторДокумента", "");
	
	Возврат СтруктураЗаполнения;
	
КонецФункции 

Функция НовыйДокумент(СтруктураЗаполнения) Экспорт

	ДокументОбъект = Документы.Оффер.СоздатьДокумент();
	
	ДокументОбъект.Дата = ТекущаяДатаСеанса();
	ЗаполнитьЗначенияСвойств(ДокументОбъект, СтруктураЗаполнения);
	
	Возврат ДокументОбъект;

КонецФункции


#КонецОбласти

#КонецЕсли
